app/controllers/admin/galleries_controller.rb

SELECT * FROM "photos" WHERE ("photos".gallery_id = 1956208378) ORDER BY position
UPDATE "photos" SET "cached_tag_list" = '', "position" = 6 WHERE "id" = 31
---
  def sort
    @gallery = @galleries_list.select {|g| g.id.to_s == params[:id]}.first
    @gallery.photos(true)
    @gallery.photos.each do |f|
      f.position = params["photo-list"].index(f.id.to_s)+1
      f.save

SELECT * FROM "galleries" WHERE ("galleries"."id" = 729667645)
UPDATE "galleries" SET "pos" = 1 WHERE "id" = 1956208378
---
  def update
    @gallery = Gallery.find params[:id]
    if @gallery.update_attributes params[:gallery]