app/controllers/admin/photos_controller.rb

  def create
    @gallery = Gallery.find(params[:gallery_id])
    @photo = Photo.new :swf_uploaded_data => params[:Filedata]
    @gallery.photos << @photo
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 729667645)
INSERT INTO "photos" ("image_file_size", "cached_tag_list", "gallery_id", "default", "ru_description", "image_content_type", "en_caption", "en_description", "image_updated_at", "position", "ru_caption", "image_file_name") VALUES(37887, '', 1539464342, 'f', NULL, 'image/jpeg', NULL, NULL, '2009-12-08 16:38:24', 26, NULL, '_03_.jpg')

  def set_default
    @gallery = Gallery.find(params[:gallery_id], :include => [:photos])
    current = @gallery.photos.select {|p| p.default? }.first || @gallery.photos.first
    @photo = Photo.find(params[:id])
    @photo.default = true
    @photo.save!
---
SELECT "photos".* FROM "photos" WHERE ("photos".gallery_id = 1539464342) ORDER BY position
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1539464342)
UPDATE "photos" SET position = (position - 1) WHERE (gallery_id = 1539464342 AND position > 15)

  def destroy
    @photo = Photo.find(params[:id])
    @gallery = @photo.gallery
    @photo.destroy
---
DELETE FROM "photos" WHERE "id" = 53